GopalSaraf/Practicals/PSDL/include/proc/pic12hv609.inc
// Register: T1CON
#define T1CON T1CON
T1CON                                    equ 0010h
// bitfield definitions
T1CON_TMR1ON_POSN                        equ 0000h
T1CON_TMR1ON_POSITION                    equ 0000h
T1CON_TMR1ON_SIZE                        equ 0001h
T1CON_TMR1ON_LENGTH                      equ 0001h
T1CON_TMR1ON_MASK                        equ 0001h
T1CON_TMR1CS_POSN                        equ 0001h
T1CON_TMR1CS_POSITION                    equ 0001h
T1CON_TMR1CS_SIZE                        equ 0001h
T1CON_TMR1CS_LENGTH                      equ 0001h
T1CON_TMR1CS_MASK                        equ 0002h
T1CON_nT1SYNC_POSN                       equ 0002h
T1CON_nT1SYNC_POSITION                   equ 0002h
T1CON_nT1SYNC_SIZE                       equ 0001h
T1CON_nT1SYNC_LENGTH                     equ 0001h
T1CON_nT1SYNC_MASK                       equ 0004h
T1CON_T1OSCEN_POSN                       equ 0003h
T1CON_T1OSCEN_POSITION                   equ 0003h
T1CON_T1OSCEN_SIZE                       equ 0001h
T1CON_T1OSCEN_LENGTH                     equ 0001h
T1CON_T1OSCEN_MASK                       equ 0008h
T1CON_T1CKPS_POSN                        equ 0004h
T1CON_T1CKPS_POSITION                    equ 0004h
T1CON_T1CKPS_SIZE                        equ 0002h
T1CON_T1CKPS_LENGTH                      equ 0002h
T1CON_T1CKPS_MASK                        equ 0030h
T1CON_TMR1GE_POSN                        equ 0006h
T1CON_TMR1GE_POSITION                    equ 0006h
T1CON_TMR1GE_SIZE                        equ 0001h
T1CON_TMR1GE_LENGTH                      equ 0001h
T1CON_TMR1GE_MASK                        equ 0040h
T1CON_T1GINV_POSN                        equ 0007h
T1CON_T1GINV_POSITION                    equ 0007h
T1CON_T1GINV_SIZE                        equ 0001h
T1CON_T1GINV_LENGTH                      equ 0001h
T1CON_T1GINV_MASK                        equ 0080h
T1CON_T1CKPS0_POSN                       equ 0004h
T1CON_T1CKPS0_POSITION                   equ 0004h
T1CON_T1CKPS0_SIZE                       equ 0001h
T1CON_T1CKPS0_LENGTH                     equ 0001h
T1CON_T1CKPS0_MASK                       equ 0010h
T1CON_T1CKPS1_POSN                       equ 0005h
T1CON_T1CKPS1_POSITION                   equ 0005h
T1CON_T1CKPS1_SIZE                       equ 0001h
T1CON_T1CKPS1_LENGTH                     equ 0001h
T1CON_T1CKPS1_MASK                       equ 0020h

// Register: VRCON
#define VRCON VRCON
VRCON                                    equ 0019h
// bitfield definitions
VRCON_VR_POSN                            equ 0000h
VRCON_VR_POSITION                        equ 0000h
VRCON_VR_SIZE                            equ 0004h
VRCON_VR_LENGTH                          equ 0004h
VRCON_VR_MASK                            equ 000Fh
VRCON_FBREN_POSN                         equ 0004h
VRCON_FBREN_POSITION                     equ 0004h
VRCON_FBREN_SIZE                         equ 0001h
VRCON_FBREN_LENGTH                       equ 0001h
VRCON_FBREN_MASK                         equ 0010h
VRCON_VRR_POSN                           equ 0005h
VRCON_VRR_POSITION                       equ 0005h
VRCON_VRR_SIZE                           equ 0001h
VRCON_VRR_LENGTH                         equ 0001h
VRCON_VRR_MASK                           equ 0020h
VRCON_C1VREN_POSN                        equ 0007h
VRCON_C1VREN_POSITION                    equ 0007h
VRCON_C1VREN_SIZE                        equ 0001h
VRCON_C1VREN_LENGTH                      equ 0001h
VRCON_C1VREN_MASK                        equ 0080h
VRCON_VR0_POSN                           equ 0000h
VRCON_VR0_POSITION                       equ 0000h
VRCON_VR0_SIZE                           equ 0001h
VRCON_VR0_LENGTH                         equ 0001h
VRCON_VR0_MASK                           equ 0001h
VRCON_VR1_POSN                           equ 0001h
VRCON_VR1_POSITION                       equ 0001h
VRCON_VR1_SIZE                           equ 0001h
VRCON_VR1_LENGTH                         equ 0001h
VRCON_VR1_MASK                           equ 0002h
VRCON_VR2_POSN                           equ 0002h
VRCON_VR2_POSITION                       equ 0002h
VRCON_VR2_SIZE                           equ 0001h
VRCON_VR2_LENGTH                         equ 0001h
VRCON_VR2_MASK                           equ 0004h
VRCON_VR3_POSN                           equ 0003h
VRCON_VR3_POSITION                       equ 0003h
VRCON_VR3_SIZE                           equ 0001h
VRCON_VR3_LENGTH                         equ 0001h
VRCON_VR3_MASK                           equ 0008h
VRCON_FVREN_POSN                         equ 0004h
VRCON_FVREN_POSITION                     equ 0004h
VRCON_FVREN_SIZE                         equ 0001h
VRCON_FVREN_LENGTH                       equ 0001h
VRCON_FVREN_MASK                         equ 0010h
VRCON_CMVREN_POSN                        equ 0007h
VRCON_CMVREN_POSITION                    equ 0007h
VRCON_CMVREN_SIZE                        equ 0001h
VRCON_CMVREN_LENGTH                      equ 0001h
VRCON_CMVREN_MASK                        equ 0080h
VRCON_VP6EN_POSN                         equ 0004h
VRCON_VP6EN_POSITION                     equ 0004h
VRCON_VP6EN_SIZE                         equ 0001h
VRCON_VP6EN_LENGTH                       equ 0001h
VRCON_VP6EN_MASK                         equ 0010h

// Register: CMCON0
#define CMCON0 CMCON0
CMCON0                                   equ 001Ah
// bitfield definitions
CMCON0_C1CH_POSN                         equ 0000h
CMCON0_C1CH_POSITION                     equ 0000h
CMCON0_C1CH_SIZE                         equ 0001h
CMCON0_C1CH_LENGTH                       equ 0001h
CMCON0_C1CH_MASK                         equ 0001h
CMCON0_C1R_POSN                          equ 0002h
CMCON0_C1R_POSITION                      equ 0002h
CMCON0_C1R_SIZE                          equ 0001h
CMCON0_C1R_LENGTH                        equ 0001h
CMCON0_C1R_MASK                          equ 0004h
CMCON0_C1POL_POSN                        equ 0004h
CMCON0_C1POL_POSITION                    equ 0004h
CMCON0_C1POL_SIZE                        equ 0001h
CMCON0_C1POL_LENGTH                      equ 0001h
CMCON0_C1POL_MASK                        equ 0010h
CMCON0_C1OE_POSN                         equ 0005h
CMCON0_C1OE_POSITION                     equ 0005h
CMCON0_C1OE_SIZE                         equ 0001h
CMCON0_C1OE_LENGTH                       equ 0001h
CMCON0_C1OE_MASK                         equ 0020h
CMCON0_C1OUT_POSN                        equ 0006h
CMCON0_C1OUT_POSITION                    equ 0006h
CMCON0_C1OUT_SIZE                        equ 0001h
CMCON0_C1OUT_LENGTH                      equ 0001h
CMCON0_C1OUT_MASK                        equ 0040h
CMCON0_C1ON_POSN                         equ 0007h
CMCON0_C1ON_POSITION                     equ 0007h
CMCON0_C1ON_SIZE                         equ 0001h
CMCON0_C1ON_LENGTH                       equ 0001h
CMCON0_C1ON_MASK                         equ 0080h
CMCON0_C1CH0_POSN                        equ 0000h
CMCON0_C1CH0_POSITION                    equ 0000h
CMCON0_C1CH0_SIZE                        equ 0001h
CMCON0_C1CH0_LENGTH                      equ 0001h
CMCON0_C1CH0_MASK                        equ 0001h
CMCON0_CMR_POSN                          equ 0002h
CMCON0_CMR_POSITION                      equ 0002h
CMCON0_CMR_SIZE                          equ 0001h
CMCON0_CMR_LENGTH                        equ 0001h
CMCON0_CMR_MASK                          equ 0004h
CMCON0_CMPOL_POSN                        equ 0004h
CMCON0_CMPOL_POSITION                    equ 0004h
CMCON0_CMPOL_SIZE                        equ 0001h
CMCON0_CMPOL_LENGTH                      equ 0001h
CMCON0_CMPOL_MASK                        equ 0010h
CMCON0_CMOE_POSN                         equ 0005h
CMCON0_CMOE_POSITION                     equ 0005h
CMCON0_CMOE_SIZE                         equ 0001h
CMCON0_CMOE_LENGTH                       equ 0001h
CMCON0_CMOE_MASK                         equ 0020h
CMCON0_COUT_POSN                         equ 0006h
CMCON0_COUT_POSITION                     equ 0006h
CMCON0_COUT_SIZE                         equ 0001h
CMCON0_COUT_LENGTH                       equ 0001h
CMCON0_COUT_MASK                         equ 0040h
CMCON0_CMON_POSN                         equ 0007h
CMCON0_CMON_POSITION                     equ 0007h
CMCON0_CMON_SIZE                         equ 0001h
CMCON0_CMON_LENGTH                       equ 0001h
CMCON0_CMON_MASK                         equ 0080h
CMCON0_CMCH_POSN                         equ 0000h
CMCON0_CMCH_POSITION                     equ 0000h
CMCON0_CMCH_SIZE                         equ 0001h
CMCON0_CMCH_LENGTH                       equ 0001h
CMCON0_CMCH_MASK                         equ 0001h

// Register: CMCON1
#define CMCON1 CMCON1
CMCON1                                   equ 001Ch
// bitfield definitions
CMCON1_C1SYNC_POSN                       equ 0000h
CMCON1_C1SYNC_POSITION                   equ 0000h
CMCON1_C1SYNC_SIZE                       equ 0001h
CMCON1_C1SYNC_LENGTH                     equ 0001h
CMCON1_C1SYNC_MASK                       equ 0001h
CMCON1_T1GSS_POSN                        equ 0001h
CMCON1_T1GSS_POSITION                    equ 0001h
CMCON1_T1GSS_SIZE                        equ 0001h
CMCON1_T1GSS_LENGTH                      equ 0001h
CMCON1_T1GSS_MASK                        equ 0002h
CMCON1_C1HYS_POSN                        equ 0003h
CMCON1_C1HYS_POSITION                    equ 0003h
CMCON1_C1HYS_SIZE                        equ 0001h
CMCON1_C1HYS_LENGTH                      equ 0001h
CMCON1_C1HYS_MASK                        equ 0008h
CMCON1_T1ACS_POSN                        equ 0004h
CMCON1_T1ACS_POSITION                    equ 0004h
CMCON1_T1ACS_SIZE                        equ 0001h
CMCON1_T1ACS_LENGTH                      equ 0001h
CMCON1_T1ACS_MASK                        equ 0010h
CMCON1_CMSYNC_POSN                       equ 0000h
CMCON1_CMSYNC_POSITION                   equ 0000h
CMCON1_CMSYNC_SIZE                       equ 0001h
CMCON1_CMSYNC_LENGTH                     equ 0001h
CMCON1_CMSYNC_MASK                       equ 0001h
CMCON1_CMHYS_POSN                        equ 0003h
CMCON1_CMHYS_POSITION                    equ 0003h
CMCON1_CMHYS_SIZE                        equ 0001h
CMCON1_CMHYS_LENGTH                      equ 0001h
CMCON1_CMHYS_MASK                        equ 0008h

// Register: OPTION_REG
#define OPTION_REG OPTION_REG
OPTION_REG                               equ 0081h
// bitfield definitions
OPTION_REG_PS_POSN                       equ 0000h
OPTION_REG_PS_POSITION                   equ 0000h
OPTION_REG_PS_SIZE                       equ 0003h
OPTION_REG_PS_LENGTH                     equ 0003h
OPTION_REG_PS_MASK                       equ 0007h
OPTION_REG_PSA_POSN                      equ 0003h
OPTION_REG_PSA_POSITION                  equ 0003h
OPTION_REG_PSA_SIZE                      equ 0001h
OPTION_REG_PSA_LENGTH                    equ 0001h
OPTION_REG_PSA_MASK                      equ 0008h
OPTION_REG_T0SE_POSN                     equ 0004h
OPTION_REG_T0SE_POSITION                 equ 0004h
OPTION_REG_T0SE_SIZE                     equ 0001h
OPTION_REG_T0SE_LENGTH                   equ 0001h
OPTION_REG_T0SE_MASK                     equ 0010h
OPTION_REG_T0CS_POSN                     equ 0005h
OPTION_REG_T0CS_POSITION                 equ 0005h
OPTION_REG_T0CS_SIZE                     equ 0001h
OPTION_REG_T0CS_LENGTH                   equ 0001h
OPTION_REG_T0CS_MASK                     equ 0020h
OPTION_REG_INTEDG_POSN                   equ 0006h
OPTION_REG_INTEDG_POSITION               equ 0006h
OPTION_REG_INTEDG_SIZE                   equ 0001h
OPTION_REG_INTEDG_LENGTH                 equ 0001h
OPTION_REG_INTEDG_MASK                   equ 0040h
OPTION_REG_nGPPU_POSN                    equ 0007h
OPTION_REG_nGPPU_POSITION                equ 0007h
OPTION_REG_nGPPU_SIZE                    equ 0001h
OPTION_REG_nGPPU_LENGTH                  equ 0001h
OPTION_REG_nGPPU_MASK                    equ 0080h
OPTION_REG_PS0_POSN                      equ 0000h
OPTION_REG_PS0_POSITION                  equ 0000h
OPTION_REG_PS0_SIZE                      equ 0001h
OPTION_REG_PS0_LENGTH                    equ 0001h
OPTION_REG_PS0_MASK                      equ 0001h
OPTION_REG_PS1_POSN                      equ 0001h
OPTION_REG_PS1_POSITION                  equ 0001h
OPTION_REG_PS1_SIZE                      equ 0001h
OPTION_REG_PS1_LENGTH                    equ 0001h
OPTION_REG_PS1_MASK                      equ 0002h
OPTION_REG_PS2_POSN                      equ 0002h
OPTION_REG_PS2_POSITION                  equ 0002h
OPTION_REG_PS2_SIZE                      equ 0001h
OPTION_REG_PS2_LENGTH                    equ 0001h
OPTION_REG_PS2_MASK                      equ 0004h

// Register: TRISIO
#define TRISIO TRISIO
TRISIO                                   equ 0085h
// bitfield definitions
TRISIO_TRISIO0_POSN                      equ 0000h
TRISIO_TRISIO0_POSITION                  equ 0000h
TRISIO_TRISIO0_SIZE                      equ 0001h
TRISIO_TRISIO0_LENGTH                    equ 0001h
TRISIO_TRISIO0_MASK                      equ 0001h
TRISIO_TRISIO1_POSN                      equ 0001h
TRISIO_TRISIO1_POSITION                  equ 0001h
TRISIO_TRISIO1_SIZE                      equ 0001h
TRISIO_TRISIO1_LENGTH                    equ 0001h
TRISIO_TRISIO1_MASK                      equ 0002h
TRISIO_TRISIO2_POSN                      equ 0002h
TRISIO_TRISIO2_POSITION                  equ 0002h
TRISIO_TRISIO2_SIZE                      equ 0001h
TRISIO_TRISIO2_LENGTH                    equ 0001h
TRISIO_TRISIO2_MASK                      equ 0004h
TRISIO_TRISIO3_POSN                      equ 0003h
TRISIO_TRISIO3_POSITION                  equ 0003h
TRISIO_TRISIO3_SIZE                      equ 0001h
TRISIO_TRISIO3_LENGTH                    equ 0001h
TRISIO_TRISIO3_MASK                      equ 0008h
TRISIO_TRISIO4_POSN                      equ 0004h
TRISIO_TRISIO4_POSITION                  equ 0004h
TRISIO_TRISIO4_SIZE                      equ 0001h
TRISIO_TRISIO4_LENGTH                    equ 0001h
TRISIO_TRISIO4_MASK                      equ 0010h
TRISIO_TRISIO5_POSN                      equ 0005h
TRISIO_TRISIO5_POSITION                  equ 0005h
TRISIO_TRISIO5_SIZE                      equ 0001h
TRISIO_TRISIO5_LENGTH                    equ 0001h
TRISIO_TRISIO5_MASK                      equ 0020h
TRISIO_TRISA0_POSN                       equ 0000h
TRISIO_TRISA0_POSITION                   equ 0000h
TRISIO_TRISA0_SIZE                       equ 0001h
TRISIO_TRISA0_LENGTH                     equ 0001h
TRISIO_TRISA0_MASK                       equ 0001h
TRISIO_TRISA1_POSN                       equ 0001h
TRISIO_TRISA1_POSITION                   equ 0001h
TRISIO_TRISA1_SIZE                       equ 0001h
TRISIO_TRISA1_LENGTH                     equ 0001h
TRISIO_TRISA1_MASK                       equ 0002h
TRISIO_TRISA2_POSN                       equ 0002h
TRISIO_TRISA2_POSITION                   equ 0002h
TRISIO_TRISA2_SIZE                       equ 0001h
TRISIO_TRISA2_LENGTH                     equ 0001h
TRISIO_TRISA2_MASK                       equ 0004h
TRISIO_TRISA3_POSN                       equ 0003h
TRISIO_TRISA3_POSITION                   equ 0003h
TRISIO_TRISA3_SIZE                       equ 0001h
TRISIO_TRISA3_LENGTH                     equ 0001h
TRISIO_TRISA3_MASK                       equ 0008h
TRISIO_TRISA4_POSN                       equ 0004h
TRISIO_TRISA4_POSITION                   equ 0004h
TRISIO_TRISA4_SIZE                       equ 0001h
TRISIO_TRISA4_LENGTH                     equ 0001h
TRISIO_TRISA4_MASK                       equ 0010h
TRISIO_TRISA5_POSN                       equ 0005h
TRISIO_TRISA5_POSITION                   equ 0005h
TRISIO_TRISA5_SIZE                       equ 0001h
TRISIO_TRISA5_LENGTH                     equ 0001h
TRISIO_TRISA5_MASK                       equ 0020h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 008Ch
// bitfield definitions
PIE1_TMR1IE_POSN                         equ 0000h
PIE1_TMR1IE_POSITION                     equ 0000h
PIE1_TMR1IE_SIZE                         equ 0001h
PIE1_TMR1IE_LENGTH                       equ 0001h
PIE1_TMR1IE_MASK                         equ 0001h
PIE1_C1IE_POSN                           equ 0003h
PIE1_C1IE_POSITION                       equ 0003h
PIE1_C1IE_SIZE                           equ 0001h
PIE1_C1IE_LENGTH                         equ 0001h
PIE1_C1IE_MASK                           equ 0008h
PIE1_T1IE_POSN                           equ 0000h
PIE1_T1IE_POSITION                       equ 0000h
PIE1_T1IE_SIZE                           equ 0001h
PIE1_T1IE_LENGTH                         equ 0001h
PIE1_T1IE_MASK                           equ 0001h
PIE1_CMIE_POSN                           equ 0003h
PIE1_CMIE_POSITION                       equ 0003h
PIE1_CMIE_SIZE                           equ 0001h
PIE1_CMIE_LENGTH                         equ 0001h
PIE1_CMIE_MASK                           equ 0008h

// Register: PCON
#define PCON PCON
PCON                                     equ 008Eh
// bitfield definitions
PCON_nBOR_POSN                           equ 0000h
PCON_nBOR_POSITION                       equ 0000h
PCON_nBOR_SIZE                           equ 0001h
PCON_nBOR_LENGTH                         equ 0001h
PCON_nBOR_MASK                           equ 0001h
PCON_nPOR_POSN                           equ 0001h
PCON_nPOR_POSITION                       equ 0001h
PCON_nPOR_SIZE                           equ 0001h
PCON_nPOR_LENGTH                         equ 0001h
PCON_nPOR_MASK                           equ 0002h
PCON_nBOD_POSN                           equ 0000h
PCON_nBOD_POSITION                       equ 0000h
PCON_nBOD_SIZE                           equ 0001h
PCON_nBOD_LENGTH                         equ 0001h
PCON_nBOD_MASK                           equ 0001h

