GopalSaraf/Practicals/PSDL/include/proc/pic12hv609.inc
// Register: OSCTUNE
#define OSCTUNE OSCTUNE
OSCTUNE                                  equ 0090h
// bitfield definitions
OSCTUNE_TUN_POSN                         equ 0000h
OSCTUNE_TUN_POSITION                     equ 0000h
OSCTUNE_TUN_SIZE                         equ 0005h
OSCTUNE_TUN_LENGTH                       equ 0005h
OSCTUNE_TUN_MASK                         equ 001Fh
OSCTUNE_TUN0_POSN                        equ 0000h
OSCTUNE_TUN0_POSITION                    equ 0000h
OSCTUNE_TUN0_SIZE                        equ 0001h
OSCTUNE_TUN0_LENGTH                      equ 0001h
OSCTUNE_TUN0_MASK                        equ 0001h
OSCTUNE_TUN1_POSN                        equ 0001h
OSCTUNE_TUN1_POSITION                    equ 0001h
OSCTUNE_TUN1_SIZE                        equ 0001h
OSCTUNE_TUN1_LENGTH                      equ 0001h
OSCTUNE_TUN1_MASK                        equ 0002h
OSCTUNE_TUN2_POSN                        equ 0002h
OSCTUNE_TUN2_POSITION                    equ 0002h
OSCTUNE_TUN2_SIZE                        equ 0001h
OSCTUNE_TUN2_LENGTH                      equ 0001h
OSCTUNE_TUN2_MASK                        equ 0004h
OSCTUNE_TUN3_POSN                        equ 0003h
OSCTUNE_TUN3_POSITION                    equ 0003h
OSCTUNE_TUN3_SIZE                        equ 0001h
OSCTUNE_TUN3_LENGTH                      equ 0001h
OSCTUNE_TUN3_MASK                        equ 0008h
OSCTUNE_TUN4_POSN                        equ 0004h
OSCTUNE_TUN4_POSITION                    equ 0004h
OSCTUNE_TUN4_SIZE                        equ 0001h
OSCTUNE_TUN4_LENGTH                      equ 0001h
OSCTUNE_TUN4_MASK                        equ 0010h

// Register: WPU
#define WPU WPU
WPU                                      equ 0095h
// bitfield definitions
WPU_WPUA0_POSN                           equ 0000h
WPU_WPUA0_POSITION                       equ 0000h
WPU_WPUA0_SIZE                           equ 0001h
WPU_WPUA0_LENGTH                         equ 0001h
WPU_WPUA0_MASK                           equ 0001h
WPU_WPUA1_POSN                           equ 0001h
WPU_WPUA1_POSITION                       equ 0001h
WPU_WPUA1_SIZE                           equ 0001h
WPU_WPUA1_LENGTH                         equ 0001h
WPU_WPUA1_MASK                           equ 0002h
WPU_WPUA2_POSN                           equ 0002h
WPU_WPUA2_POSITION                       equ 0002h
WPU_WPUA2_SIZE                           equ 0001h
WPU_WPUA2_LENGTH                         equ 0001h
WPU_WPUA2_MASK                           equ 0004h
WPU_WPUA4_POSN                           equ 0004h
WPU_WPUA4_POSITION                       equ 0004h
WPU_WPUA4_SIZE                           equ 0001h
WPU_WPUA4_LENGTH                         equ 0001h
WPU_WPUA4_MASK                           equ 0010h
WPU_WPUA5_POSN                           equ 0005h
WPU_WPUA5_POSITION                       equ 0005h
WPU_WPUA5_SIZE                           equ 0001h
WPU_WPUA5_LENGTH                         equ 0001h
WPU_WPUA5_MASK                           equ 0020h
WPU_WPU0_POSN                            equ 0000h
WPU_WPU0_POSITION                        equ 0000h
WPU_WPU0_SIZE                            equ 0001h
WPU_WPU0_LENGTH                          equ 0001h
WPU_WPU0_MASK                            equ 0001h
WPU_WPU1_POSN                            equ 0001h
WPU_WPU1_POSITION                        equ 0001h
WPU_WPU1_SIZE                            equ 0001h
WPU_WPU1_LENGTH                          equ 0001h
WPU_WPU1_MASK                            equ 0002h
WPU_WPU2_POSN                            equ 0002h
WPU_WPU2_POSITION                        equ 0002h
WPU_WPU2_SIZE                            equ 0001h
WPU_WPU2_LENGTH                          equ 0001h
WPU_WPU2_MASK                            equ 0004h
WPU_WPU4_POSN                            equ 0004h
WPU_WPU4_POSITION                        equ 0004h
WPU_WPU4_SIZE                            equ 0001h
WPU_WPU4_LENGTH                          equ 0001h
WPU_WPU4_MASK                            equ 0010h
WPU_WPU5_POSN                            equ 0005h
WPU_WPU5_POSITION                        equ 0005h
WPU_WPU5_SIZE                            equ 0001h
WPU_WPU5_LENGTH                          equ 0001h
WPU_WPU5_MASK                            equ 0020h

// Register: IOC
#define IOC IOC
IOC                                      equ 0096h
// bitfield definitions
IOC_IOC0_POSN                            equ 0000h
IOC_IOC0_POSITION                        equ 0000h
IOC_IOC0_SIZE                            equ 0001h
IOC_IOC0_LENGTH                          equ 0001h
IOC_IOC0_MASK                            equ 0001h
IOC_IOC1_POSN                            equ 0001h
IOC_IOC1_POSITION                        equ 0001h
IOC_IOC1_SIZE                            equ 0001h
IOC_IOC1_LENGTH                          equ 0001h
IOC_IOC1_MASK                            equ 0002h
IOC_IOC2_POSN                            equ 0002h
IOC_IOC2_POSITION                        equ 0002h
IOC_IOC2_SIZE                            equ 0001h
IOC_IOC2_LENGTH                          equ 0001h
IOC_IOC2_MASK                            equ 0004h
IOC_IOC3_POSN                            equ 0003h
IOC_IOC3_POSITION                        equ 0003h
IOC_IOC3_SIZE                            equ 0001h
IOC_IOC3_LENGTH                          equ 0001h
IOC_IOC3_MASK                            equ 0008h
IOC_IOC4_POSN                            equ 0004h
IOC_IOC4_POSITION                        equ 0004h
IOC_IOC4_SIZE                            equ 0001h
IOC_IOC4_LENGTH                          equ 0001h
IOC_IOC4_MASK                            equ 0010h
IOC_IOC5_POSN                            equ 0005h
IOC_IOC5_POSITION                        equ 0005h
IOC_IOC5_SIZE                            equ 0001h
IOC_IOC5_LENGTH                          equ 0001h
IOC_IOC5_MASK                            equ 0020h
IOC_IOCA0_POSN                           equ 0000h
IOC_IOCA0_POSITION                       equ 0000h
IOC_IOCA0_SIZE                           equ 0001h
IOC_IOCA0_LENGTH                         equ 0001h
IOC_IOCA0_MASK                           equ 0001h
IOC_IOCA1_POSN                           equ 0001h
IOC_IOCA1_POSITION                       equ 0001h
IOC_IOCA1_SIZE                           equ 0001h
IOC_IOCA1_LENGTH                         equ 0001h
IOC_IOCA1_MASK                           equ 0002h
IOC_IOCA2_POSN                           equ 0002h
IOC_IOCA2_POSITION                       equ 0002h
IOC_IOCA2_SIZE                           equ 0001h
IOC_IOCA2_LENGTH                         equ 0001h
IOC_IOCA2_MASK                           equ 0004h
IOC_IOCA3_POSN                           equ 0003h
IOC_IOCA3_POSITION                       equ 0003h
IOC_IOCA3_SIZE                           equ 0001h
IOC_IOCA3_LENGTH                         equ 0001h
IOC_IOCA3_MASK                           equ 0008h
IOC_IOCA4_POSN                           equ 0004h
IOC_IOCA4_POSITION                       equ 0004h
IOC_IOCA4_SIZE                           equ 0001h
IOC_IOCA4_LENGTH                         equ 0001h
IOC_IOCA4_MASK                           equ 0010h
IOC_IOCA5_POSN                           equ 0005h
IOC_IOCA5_POSITION                       equ 0005h
IOC_IOCA5_SIZE                           equ 0001h
IOC_IOCA5_LENGTH                         equ 0001h
IOC_IOCA5_MASK                           equ 0020h

// Register: ANSEL
#define ANSEL ANSEL
ANSEL                                    equ 009Fh
// bitfield definitions
ANSEL_ANS_POSN                           equ 0000h
ANSEL_ANS_POSITION                       equ 0000h
ANSEL_ANS_SIZE                           equ 0004h
ANSEL_ANS_LENGTH                         equ 0004h
ANSEL_ANS_MASK                           equ 000Fh
ANSEL_ADCS_POSN                          equ 0004h
ANSEL_ADCS_POSITION                      equ 0004h
ANSEL_ADCS_SIZE                          equ 0003h
ANSEL_ADCS_LENGTH                        equ 0003h
ANSEL_ADCS_MASK                          equ 0070h
ANSEL_ANS0_POSN                          equ 0000h
ANSEL_ANS0_POSITION                      equ 0000h
ANSEL_ANS0_SIZE                          equ 0001h
ANSEL_ANS0_LENGTH                        equ 0001h
ANSEL_ANS0_MASK                          equ 0001h
ANSEL_ANS1_POSN                          equ 0001h
ANSEL_ANS1_POSITION                      equ 0001h
ANSEL_ANS1_SIZE                          equ 0001h
ANSEL_ANS1_LENGTH                        equ 0001h
ANSEL_ANS1_MASK                          equ 0002h
ANSEL_ANS3_POSN                          equ 0003h
ANSEL_ANS3_POSITION                      equ 0003h
ANSEL_ANS3_SIZE                          equ 0001h
ANSEL_ANS3_LENGTH                        equ 0001h
ANSEL_ANS3_MASK                          equ 0008h

